---
type: Wave
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 15
tags: [revit-api, class]
---

# Wave

`Autodesk.Revit.DB.Visual.Wave` · Revit 2024 · 15 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | TextureAngle | 2018.1 | `public static string TextureAngle { get ; }` |
| Property | TextureLinkTextureTransforms | 2018.1 | `public static string TextureLinkTextureTransforms { get ; }` |
| Property | TextureRealWorldOffsetX | 2018.1 | `public static string TextureRealWorldOffsetX { get ; }` |
| Property | TextureRealWorldOffsetY | 2018.1 | `public static string TextureRealWorldOffsetY { get ; }` |
| Property | TextureRealWorldOffsetZ | 2018.1 | `public static string TextureRealWorldOffsetZ { get ; }` |
| Property | WaveAmplitude | 2018.1 | `public static string WaveAmplitude { get ; }` |
| Property | WaveColor1 | 2018.1 | `public static string WaveColor1 { get ; }` |
| Property | WaveColor2 | 2018.1 | `public static string WaveColor2 { get ; }` |
| Property | WaveDistribution | 2018.1 | `public static string WaveDistribution { get ; }` |
| Property | WaveNumWaveSets | 2018.1 | `public static string WaveNumWaveSets { get ; }` |
| Property | WavePhase | 2018.1 | `public static string WavePhase { get ; }` |
| Property | WaveRandomSeed | 2018.1 | `public static string WaveRandomSeed { get ; }` |
| Property | WaveWaveLenMax | 2018.1 | `public static string WaveWaveLenMax { get ; }` |
| Property | WaveWaveLenMin | 2018.1 | `public static string WaveWaveLenMin { get ; }` |
| Property | WaveWaveRadius | 2018.1 | `public static string WaveWaveRadius { get ; }` |